Repository: ShawnBeasleyOTRS/doc-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de, hu

source: The entire process can take considerable time to run, depending on the number of articles you have and the available CPU power and/or network capacity.
de: Der gesamte Prozess kann einige Zeit in Anspruch nehmen, abhängig von der Anzahl der Artikel, der verfügbaren CPU-Leistung und / oder der Netzwerkkapazität.
hu: A teljes folyamat futtatása számottevő ideig eltarthat a meglévő bejegyzések számától és az elérhető processzorteljesítménytől és/vagy hálózati kapacitástól függően.

source: If you want to keep old attachments in the database, you can activate the system configuration option ``Ticket::Article::Backend::MIMEBase::CheckAllStorageBackends`` to make sure OTRS will still find them.
de: Wenn Sie alte Anhänge in der Datenbank behalten möchten, können Sie die Systemkonfigurationsoption ``Ticket::Article::Backend::MIMEBase::CheckAllStorageBackends`` aktivieren, um sicherzustellen, dass OTRS diese weiterhin findet.
hu: Ha a régi mellékleteket az adatbázisban szeretné tartani, akkor bekapcsolhatja a ``Ticket::Article::Backend::MIMEBase::CheckAllStorageBackends`` rendszerbeállítási lehetőséget annak biztosításához, hogy az OTRS továbbra is megtalálja azokat.

source: Archiving Tickets
de: Tickets archivieren
hu: Jegyek archiválása

source: As OTRS can be used as an audit-proof system, deleting closed tickets may not be a good idea. Therefore we implemented a feature that allows you to archive tickets.
de: Da OTRS als revisionssicheres System betrieben werden kann, ist das Löschen von geschlossenen Tickets möglicherweise nicht empfehlenswert. Daher haben wir eine Funktion implementiert, mit der Sie Tickets archivieren können.
hu: Mivel az OTRS használható vizsgálatigazoló rendszerként, emiatt a lezárt jegyek törlése nem lenne jó ötlet. Ezért megvalósítottunk egy olyan szolgáltatást, amely lehetővé teszi a jegyek archiválását.

source: Tickets that match certain criteria can be marked as archived. These tickets are not accessed if you do a regular ticket search or run a generic agent job. The system itself does not have to deal with a huge amount of tickets any longer as only the latest tickets are taken into consideration when using OTRS. This can result in a huge performance gain on large systems.
de: Tickets, die bestimmten Kriterien entsprechen, können als archiviert markiert werden. Auf diese Tickets wird nicht zugegriffen, wenn Sie eine reguläre Ticketsuche durchführen oder einen generischen Agentenjob ausführen. Das System selbst muss nicht mehr mit einer großen Anzahl von Tickets umgehen, da bei der Verwendung von OTRS nur die neuesten Tickets berücksichtigt werden. Dies kann bei großen Systemen zu einem enormen Leistungszuwachs führen.
hu: Azok a jegyek, amelyek bizonyos feltételekre illeszkednek, megjelölhetők archiváltként. Ezek a jegyek nem lesznek hozzáférhetők, ha egy szabályos jegykeresést hajt végre, vagy egy általános ügyintéző feladatot futtat. Magának a rendszernek többé nem kell foglalkoznia a jegyek hatalmas mennyiségével, mivel csak a legújabb jegyeket kell figyelembe venni az OTRS használatakor. Ez egy hatalmas teljesítménynövekedést eredményezhet nagy rendszereknél.

source: To use the archive feature:
de: So verwenden Sie die Archivfunktion:
hu: Az archiválás funkció használatához:

source: Activate the ``Ticket::ArchiveSystem`` setting in the system configuration.
de: Aktivieren Sie die Einstellung ``Ticket::ArchiveSystem`` in der Systemkonfiguration.
hu: Kapcsolja be a ``Ticket::ArchiveSystem`` beállítást a rendszerbeállításokban.

source: Define a generic agent job:
de: Definieren Sie einen GenericAgent-Job:
hu: Határozzon meg egy általános ügyintéző feladatot:

source: Click on the *Add Job* button in the *Generic Agent* screen.
de: Klicken Sie im Bildschirm *GenericAgent* auf die Schaltfläche *Job hinzufügen*.
hu: Kattintson a *Feladat hozzáadása* gombra az *Általános ügyintéző* képernyőn.

source: *Job Settings*: provide a name for the archiving job.
de: *Job-Einstellungen*: Geben Sie einen Namen für den Archivierungsjob an.
hu: *Feladat beállításai*: adjon egy nevet az archiváló feladatnak.

source: *Automatic Execution*: select proper options to schedule this job.
de: *Automatische Ausführung*: Wählen Sie die richtigen Optionen aus, um diesen Job zu planen.
hu: *Automatikus végrehajtás*: válassza ki a megfelelő beállításokat a feladat ütemezéséhez.

source: *Select Tickets*: it might be a good idea to only archive those tickets in a closed state that have been closed a few months before.
de: *Tickets selektieren*: Es kann eine gute Idee sein, nur die Tickets in einem geschlossenen Zustand zu archivieren, die einige Monate zuvor geschlossen wurden.
hu: *Jegyek kijelölése*: jó ötletnek tűnik csak azokat a lezárt állapotú jegyeket archiválni, amelyeket néhány hónappal ezelőtt zártak el.

source: *Update/Add Ticket Attributes*: set the field *Archive selected tickets* to *archive tickets*.
de: *Ticketattribute aktualisieren / hinzufügen*: Setzen Sie das Feld *Ausgewählte Tickets archivieren* auf *Tickets archivieren*.
hu: *Jegyjellemzők frissítése/hozzáadása*: állítsa be az *Kijelölt jegyek archiválása* mezőt *jegyek archiválása* értékre.

source: Save the job at the end of the page.
de: Speichern Sie den Job am Ende der Seite.
hu: Mentse el a feladatot az oldal alján.

source: Click on the *Run this task* link in the overview table to see the affected tickets.
de: Klicken Sie in der Übersichtstabelle auf den Link *Diese Aufgabe ausführen* , um die betroffenen Tickets anzuzeigen.
hu: Kattintson a *Feladat futtatása* hivatkozásra az áttekintő táblázatban az érintett jegyek megtekintéséhez.

source: Click on the *Run Job* button.
de: Klicken Sie auf die Schaltfläche *Diesen Job ausführen*.
hu: Kattintson a *Feladat futtatása* gombra.

source: Up to 5000 tickets can be modified by running this job manually.
de: Bis zu 5000 Tickets können durch manuelle Ausführung dieses Jobs geändert werden.
hu: Legfeljebb 5000 jegyet lehet módosítani a feladat kézzel történő futtatásakor.

source: When you search for tickets, the system default is to search tickets which are not archived.
de: Bei der Suche nach Tickets werden standardmäßig nicht archivierte Tickets durchsucht.
hu: Amikor rákeres a jegyekre, akkor a rendszer alapértelmezetten csak azokra a jegyekre keres rá, amelyek nincsenek archiválva.

source: To search for archived tickets:
de: So suchen Sie nach archivierten Tickets:
hu: Az archivált jegyek kereséséhez:

source: Open the ticket search screen.
de: Öffnen Sie die Ticketsuche.
hu: Nyissa meg a jegykeresés képernyőt.

source: Set *Archive search* to *Unarchived tickets* or *All tickets*.
de: Setzen Sie *Archivsuche* auf *Nicht archivierte Tickets* oder *Alle Tickets*.
hu: Állítsa át az *Archívum keresés* mezőt *Archiválatlan jegyek* értékről *Összes jegy* értékre.

source: Perform the search.
de: Führen Sie die Suche durch.
hu: Hajtsa végre a keresést.

source: Tuning the Web Server
de: Webserver optimieren
hu: A webkiszolgáló finomhangolása

source: The built-in web server of OTRS can handle small and medium setups out of the box. When OTRS serves many users simultaneously, it may be necessary to tweak the web server configuration to increase the number of worker processes, for example.
de: Der integrierte Webserver von OTRS kann kleine und mittlere Setups sofort ausführen. Wenn OTRS von vielen Benutzer gleichzeitig genutzt wird, kann es erforderlich sein, die Webserverkonfiguration zu optimieren, um beispielsweise die Anzahl der Arbeitsprozesse zu erhöhen.
hu: Az OTRS beépített webkiszolgálója további beállítások nélkül képes kezelni a kicsi és közepes telepítéseket. Amikor az OTRS több felhasználót egyidejűleg szolgál ki, akkor szükséges lehet a webkiszolgáló beállításainak finomhangolása, például a munkavégző folyamatok számának növelése.

source: The web server configuration file is located in ``Kernel/WebApp.conf``, and all settings there are documented. The ``worker`` setting can be increased to deploy more processes for serving HTTP requests on capable servers.
de: Die Konfigurationsdatei des Webservers befindet sich in ``Kernel/WebApp.conf``, und alle Einstellungen sind dokumentiert. Die Einstellung für ``Worker`` kann erhöht werden, um mehr Prozesse für die Bereitstellung von HTTP-Anforderungen auf fähigen Servern bereitzustellen.
hu: A webkiszolgáló beállítófájlja a ``Kernel/WebApp.conf`` fájlban található, és az összes beállítás dokumentálva van. A ``worker`` beállítás növelhető több folyamat üzembe állításához a HTTP-kérések kiszolgálásánál az erre alkalmas kiszolgálókon.

source: Caching
hu: Gyorsítótárazás

source: OTRS caches a lot of temporary data in ``/opt/otrs/var/tmp``. Please make sure that this uses a high performance file system and storage. If you have enough RAM, you can also try to put this directory on a ramdisk like this:
de: OTRS speichert viele temporäre Daten in ``/opt/otrs/var/tmp``. Stellen Sie sicher, dass dieses Verzeichnis ein Hochleistungs-Dateisystem und -speicher verwendet. Wenn Sie über genügend RAM verfügen, können Sie auch versuchen, dieses Verzeichnis auf einer RAM-Disk wie folgt abzulegen:
hu: Az OTRS rengeteg átmeneti adatot gyorsítótáraz az ``/opt/otrs/var/tmp`` könyvtárban. Győződjön meg arról, hogy ez egy nagy teljesítményű fájlrendszert és tárolót használ-e. Ha elegendő RAM van a gépben, akkor megpróbálhatja ezt a könyvtárat egy memórialemezre áttenni ehhez hasonlóan:

source: Add persistent mount point in ``/etc/fstab``.
de: Fügen Sie einen dauerhaften Einhängepunkt in ``/etc/fstab`` hinzu.
hu: Adjon meg állandó csatolási pontot az ``/etc/fstab`` fájlban.

source: This will be a non-permanent storage that will be lost on server reboot. All your sessions (if you store them in the file system) and your cache data will be lost.
de: Dies ist ein nicht permanenter Speicher, der bei einem Neustart des Servers verloren geht. Alle Ihre Sitzungen (wenn Sie sie im Dateisystem speichern) und Ihre Cache-Daten gehen verloren.
hu: Ez egy nem állandó tároló lesz, amely el fog veszi a kiszolgáló újraindításakor. Az összes munkamenete (ha a fájlrendszeren tárolja azokat) és a gyorsítótárazott adatok el fognak veszni.

source: There is also a centralized `memcached based cache back end <https://otrs.com/otrs-feature/feature-add-on-cache-memcached-fast/>`__ available for purchase from OTRS Group.
de: Es gibt auch ein zentrales, auf `Memcached-basierendes Cache-Backend <https://otrs.com/de/otrs-feature/feature-add-on-cache-memcached-fast/>`__, das von der OTRS Group erworben werden kann.
hu: Elérhető egy központosított `memcached alapú gyorsítótár háttérprogram <https://otrs.com/otrs-feature/feature-add-on-cache-memcached-fast/>`__ is, amely megvásárolható az OTRS csoporttól.

source: Clustering
hu: Fürtözés

source: For very high loads, it can be required to operate OTRS on a cluster of multiple front end servers. This is a complex task with many pitfalls. Therefore, OTRS Group provides support for clusters in its `managed OTRS <https://otrs.com/how-to-buy/>`__ environment exclusively.
de: Bei sehr hohen Lasten kann es erforderlich sein, OTRS in einem Cluster mehrerer Frontend-Server zu betreiben. Dies ist eine komplexe Aufgabe mit vielen Fallstricken. Daher bietet die OTRS Group ausschließlich Unterstützung für Cluster in ihrer `managed OTRS <https://otrs.com/how-to-buy/>`__-Umgebung.
hu: Nagyon magas terhelésnél szükséges lehet az OTRS-t egy több előtétprogramos kiszolgálóból álló fürtön működtetni. Ez egy bonyolult feladat sok buktatóval. Emiatt az OTRS csoport kizárólagos támogatást biztosít a `menedzselt OTRS <https://otrs.com/how-to-buy/>`__ környezetében.

source: Hardware and Software Requirements
de: Hardware- und Software-Anforderungen
hu: Hardver- és szoftverkövetelmények

source: OTRS can be installed on Linux and on other Unix derivates (e.g. OpenBSD or FreeBSD). To run OTRS on Microsoft Windows is not possible.
de: OTRS kann unter Linux und anderen Unix-Derivaten (z. B. OpenBSD oder FreeBSD) installiert werden. Das Ausführen von OTRS unter Microsoft Windows ist nicht möglich.
hu: Az OTRS telepíthető Linuxra és egyéb UNIX-származékokra (például OpenBSD-re vagy FreeBSD-re). Az OTRS futtatása Microsoft Windowson nem lehetséges.

source: To run OTRS, you'll also need to use a web server as reverse proxy and a database server. Apart from that, you should install Perl and/or install some additional Perl modules on the OTRS machine.
de: Um OTRS auszuführen, müssen Sie auch einen Webserver als Reverse Proxy und einen Datenbankserver verwenden. Ansonsten sollten Sie Perl installieren und / oder einige zusätzliche Perl-Module auf dem OTRS-Rechner installieren.
hu: Az OTRS futtatásához szüksége lesz egy fordított proxyként működő webkiszolgáló és egy adatbázis-kiszolgáló használatára is. Ettől eltekintve telepítenie kell a Perl parancsértelmezőt és/vagy telepítenie kell néhány további Perl-modult az OTRS-gépre.

source: Perl must be installed on the same machine as OTRS. The database back end and the web server may be installed locally or on another host.
de: Perl muss auf demselben Rechner wie OTRS installiert sein. Das Datenbank-Backend und der Webserver können lokal oder auf einem anderen Host installiert werden.
hu: A Perl parancsértelmezőt ugyanarra a gépre kell telepíteni mint az OTRS-t. Az adatbázis háttérprogram és a webkiszolgáló telepíthető helyileg vagy egy távoli gépre.

source: For Perl, you will need some additional modules which can be installed either with the Perl shell and CPAN, or via the package manager of your operating system (rpm, yast, apt-get).
de: Für Perl benötigen Sie einige zusätzliche Module, die entweder mit der Perl-Shell und CPAN oder über den Paketmanager Ihres Betriebssystems (rpm, yast, apt-get) installiert werden können.
hu: A Perl parancsértelmezőhöz szüksége lesz néhány további modulra, amelyek vagy a Perl parancsértelmezővel és CPAN használatával, vagy az operációs rendszer csomagkezelőjén keresztül (rpm, yast, apt-get) telepíthetők.

source: OTRS has a console command to check the environment and the missing modules.
de: OTRS verfügt über einen Konsolenbefehl zur Überprüfung der Umgebung und der fehlenden Module.
hu: Az OTRS rendelkezik egy konzolparanccsal a környezet és a hiányzó modulok ellenőrzéséhez.

source: If some packages are missing, you can get an install command for your operating system, if you run the script with ``--list`` option.
de: Wenn einige Pakete fehlen, können Sie einen Installationsbefehl für Ihr Betriebssystem erhalten, wenn Sie das Skript mit der Option ``--list`` ausführen.
hu: Ha valamelyik csomag hiányzik, akkor kaphat egy telepítési parancsot az operációs rendszeréhez, ha a ``--list`` kapcsolóval futtatja a parancsfájlt.

source: If all needed packages are installed, the output of the environment check script shows the installed packages and the version numbers.
de: Wenn alle benötigten Pakete installiert sind, werden in der Ausgabe des Umgebungsprüfungsskripts die installierten Pakete und die Versionsnummern angezeigt.
hu: Ha az összes szükséges csomag telepítve van, akkor a környezet-ellenőrző parancsfájl kimenete megjeleníti a telepített csomagokat és azok verziószámait.

source: Hardware Requirements
de: Hardware Anforderungen
hu: Hardverkövetelmények

source: Hardware requirements highly depend on the usage of OTRS. OTRS can be used to process a few tickets per month or to process hundreds of tickets per day. The storage requirement also depends on the number of tickets and size of attachments.
de: Die Hardware Anforderungen hängen stark davon ab, wie OTRS genutzt wird. OTRS kann genutzt werden, um ein paar Tickets pro Monat oder mehrere Tickets pro Tag zu verarbeiten. Die Anforderungen an den Speicherplatz hängen ebenfalls von der Anzahl der Tickets und der Größe der Anlagen ab.
hu: A hardverkövetelmények erősen függnek az OTRS használatától. Az OTRS használható havi néhány jegy feldolgozásához vagy naponta több száz jegy feldolgozásához is. A tárolási követelmény szintén a jegyek számától és a mellékletek méretétől függ.

source: We recommend using a machine with **at least**:
de: Wir empfehlen die Verwendung einer Maschine mit **wenigstens**:
hu: Azt javasoljuk, hogy olyan gépet használjon, amelyben van **legalább**:

source: 3 GHz Xeon or comparable CPU
de: 3 GHz Xeon oder vergleichbare CPU
hu: 3 GHz Xeon vagy ezzel egyenértékű CPU

source: 256 GB storage
de: 256 GB Speicherplatz
hu: 256 GB tárhely

source: Hardware requirements depend on the usage of OTRS. Please contact your OTRS consultant before deploying a hardware.
de: Die Hardware Anforderungen sind abhängig vom Einsatz von OTRS. Bitte wenden Sie sich an Ihren OTRS-Berater, bevor Sie eine Hardware bereitstellen.
hu: A hardverkövetelmények az OTRS használatától függenek. Vegye fel a kapcsolatot az OTRS tanácsadójával, mielőtt üzembe állítana egy hardvert.

source: Software requirements
de: Software-Anforderungen
hu: Szoftverkövetelmények

source: Perl 5.16.0 or higher
de: Perl 5.16.0 oder höher
hu: Perl 5.16.0 vagy magasabb

source: Perl packages listed by ``/opt/otrs/bin/otrs.CheckEnvironment.pl`` console command
de: Perl-Pakete, die mit dem Konsolenbefehl ``/opt/otrs/bin/otrs.CheckEnvironment.pl`` aufgelistet werden
hu: Az ``/opt/otrs/bin/otrs.CheckEnvironment.pl`` konzolparancs által felsorolt Perl-csomagok

source: Web Servers
de: Webserver
hu: Webkiszolgálók

source: Any other web server that can be used as a reverse proxy
de: Jeder andere Webserver, der als Reverse Proxy verwendet werden kann
hu: Bármely egyéb webkiszolgáló, amely használható fordított proxyként

source: Databases
de: Datenbanken
hu: Adatbázisok

source: MySQL 5.0 or higher
de: MySQL 5.0 oder höher
hu: MySQL 5.0 vagy magasabb

source: PostgreSQL 9.2 or higher
de: PostgreSQL 9.2 oder höher
hu: PostgreSQL 9.2 vagy magasabb

source: Oracle 10g or higher
de: Oracle 10g oder höher
hu: Oracle 10g vagy magasabb

source: Other dependencies
de: Andere Abhängigkeiten
hu: Egyéb függőségek

source: Elasticsearch 6.0 or higher
de: Elasticsearch 6.0 oder höher
hu: Elasticsearch 6.0 vagy magasabb

source: Node.js 8.9 or higher
de: Node.js 8.9 oder höher
hu: Node.js 8.9 vagy magasabb

source: Web browsers
de: Web Browser
hu: Webböngészők

source: Apple Safari version 7 or higher
de: Apple Safari Version 7 oder höher
hu: Apple Safari 7-es verzió vagy magasabb

source: Mozilla Firefox version 32 or higher
de: Mozilla Firefox Version 32 oder höher
hu: Mozilla Firefox 32-es verzió vagy magasabb

source: Any other modern web browser with JavaScript support
de: Jeder andere moderne Webbrowser mit JavaScript-Unterstützung
hu: Bármilyen egyéb modern webböngésző JavaScript támogatással

source: Updating
de: Aktualisieren
hu: Frissítés

source: It is highly recommended to perform a test update on a separate testing machine first.
de: Es wird empfohlen, zuerst ein Test-Update auf einem seperaten Testsystem durchzuführen.
hu: Erősen ajánlott először egy próbafrissítést végrehajtani egy elkülönített tesztelési gépen.

source: Updating from an earlier version of OTRS 7
de: Aktualisierung von einer früheren Version von OTRS 7
hu: Frissítés az OTRS 7 egy korábbi verziójáról

source: You can update directly from any previous to the latest available patch level release.
de: Sie können direkt von allen vorherigen Patch-Releases aktualisieren.
hu: Frissíthet közvetlenül bármely előző verzióról az elérhető legfrissebb hibajavító szintű kiadásra.

source: Updating from OTRS 6
de: Aktualisierung von OTRS 6
hu: Frissítés OTRS 6-ról

source: You can update from any OTRS 6 patch level release to the latest available OTRS 7 patch level release.
de: Sie können von jeder OTRS 6 Patch Version auf die neueste verfügbare OTRS 7 Patch Version aktualisieren.
hu: Frissíthet bármely OTRS 6 hibajavító szintű kiadásról az elérhető legfrissebb OTRS 7 hibajavító szintű kiadásra.

source: Updating from OTRS 5 or earlier
de: Aktualisierung von OTRS 5 oder früher
hu: Frissítés OTRS 5-ről vagy egy korábbi verzióról

source: You cannot update from OTRS 5 or earlier directly to OTRS 7. Full updates to all available minor versions have to be made sequentially instead. For example, if you come from OTRS 4, you first have to perform a full update to OTRS 5, then to OTRS 6 and finally to OTRS 7.
de: Sie können ein Update von OTRS 5 oder früheren Versionen auf OTRS 7 nicht direkt durchführen. Vollständige Updates für alle verfügbaren Minor Versionen müssen stattdessen nacheinander vorgenommen werden. Wenn Sie beispielsweise von OTRS 4 kommen, müssen Sie zuerst ein vollständiges Update auf OTRS 5, dann auf OTRS 6 und schließlich auf OTRS 7 durchführen.
hu: Nem frissíthet az OTRS 5-ről vagy egy korábbi kiadásról közvetlenül OTRS 7-re. Ehelyett teljes frissítést kell elvégezni egymás után az összes elérhető kisebb verzióra. Például ha az OTRS 4-ről indul, akkor először teljes frissítést kell végrehajtani az OTRS 5-re, majd OTRS 6-ra és végül az OTRS 7-re.

source: See the admin manual of the previous versions of OTRS for the update instructions.
de: Informationen zum Update finden Sie im Administratorhandbuch der vorherigen Versionen von OTRS.
hu: Nézze meg az OTRS előző verzióinak adminisztrátori kézikönyvét a frissítési utasításokért.

source: Step 1: Stop All Relevant Services and the OTRS Daemon
de: Schritt 1: Alle relevanten Dienste und den OTRS Deamon beenden
hu: 1. lépés: az összes kapcsolódó szolgáltatás és az OTRS démon leállítása

source: Please make sure there are no more running services or cron jobs that try to access OTRS. This will depend on your service configuration and OTRS version.
de: Stellen Sie sicher, dass keine weiteren Dienste oder Cron-Jobs mehr vorhanden sind, die versuchen, auf OTRS zuzugreifen. Dies hängt von Ihrer Dienstkonfiguration und der OTRS-Version ab.
hu: Győződjön meg arról, hogy nincs-e több olyan futó szolgáltatás vagy cron-feladat, amely megpróbál hozzáférni az OTRS-hez. Ez a szolgáltatás beállításától és az OTRS verziójától fog függeni.

source: If you do a major update form OTRS 6, you need to stop the old OTRS cron jobs and daemon (in this order):
de: Wenn Sie ein Major Update von OTRS 6 durchführen, müssen Sie die alten OTRS-Cron-Jobs und den Daemon (in dieser Reihenfolge) stoppen:
hu: Ha főverzió-frissítést hajt végre OTRS 6-ról, akkor le kell állítania a régi OTRS cron-feladatokat és a démont (ebben a sorrendben):

source: If you do a patch level update within OTRS 7 (using the new systemd files), stop the OTRS services via systemd:
de: Wenn Sie in OTRS 7 ein Update auf Patch-Ebene durchführen (mit den neuen systemd-Dateien), stoppen Sie die OTRS-Dienste über systemd:
hu: Ha hibajavító szintű frissítést hajt végre az OTRS 7-en belül (az új systemd fájlok használatával), akkor állítsa le az OTRS szolgáltatásokat a systemd parancson keresztül:

source: Step 2: Backup Files and Database
de: Schritt 2: Dateien und Datenbank sichern
hu: 2. lépés: fájlok és adatbázis biztonsági mentése

source: Create a backup of the following files and folders:
de: Erstellen Sie eine Sicherung der folgenden Dateien und Ordner:
hu: Készítsen biztonsági mentést a következő fájlokról és mappákról:

source: ``Kernel/WebApp.conf`` (only in case of a patch level update of OTRS 7, and only if the file was modified)
de: ``Kernel/WebApp.conf`` (nur bei Patch-Update von OTRS 7 und nur bei geänderter Datei)
hu: ``Kernel/WebApp.conf`` (csak az OTRS 7 hibajavítás szintű frissítése esetén, és csak akkor, ha a fájlt módosították)

source: as well as the database
de: ebenfalls die Datenbank
hu: valamint az adatbázisról
