Repository: ShawnBeasleyOTRS/doc-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de, hu

source: Don't proceed without a complete backup of your system. Use the :ref:`backup` script for this.
de: Fahren Sie nicht ohne eine vollständige Sicherung Ihres Systems fort. Verwenden Sie dazu das Skript :ref:`backup`.
hu: Ne folytassa a rendszer teljes biztonsági mentése nélkül. Használja a :ref:`backup` parancsfájlt ehhez.

source: Step 3: Install the New Release
de: Schritt 3: Das neue Release installieren
hu: 3. lépés: az új kiadás telepítése

source: With OTRS 7 RPMs are no longer provided. RPM based installations need to switch by uninstalling the RPM (this will not drop your database) and using the source archives instead.
de: Mit OTRS 7 werden keine RPMs mehr bereitgestellt. RPM-basierte Installationen müssen gändert werden: Durch Deinstallieren des RPM (dabei wird Ihre Datenbank nicht gelöscht) und durch Verwendung der Quellarchive.
hu: Az OTRS 7-tel az RPM-csomagok többé nem érhetők el. Az RPM-alapú telepítéseket át kell költöztetni az RPM-csomagok eltávolításával (ez nem fogja eldobni az adatbázist) és helyettük a forrásarchívumokat kell használni.

source: Restore Old Configuration Files
de: Alte Konfigurationsdateien wiederherstellen
hu: Régi beállítófájlok visszaállítása

source: Restore Article Data
de: Artikeldaten wiederherstellen
hu: Bejegyzésadatok visszaállítása

source: If you configured OTRS to store article data in the file system you have to restore the ``article`` folder to ``/opt/otrs/var/`` or the folder specified in the system configuration.
de: Wenn Sie OTRS so konfiguriert haben, dass Artikeldaten im Dateisystem gespeichert werden, müssen Sie den Ordner ``article`` nach ``/opt/otrs/var/`` (oder in dem in der Systemkonfiguration angegebenen Ordner) wiederherstellen.
hu: Ha úgy állította be az OTRS-t, hogy a bejegyzésadatokat a fájlrendszeren tárolja, akkor vissza kell állítania az ``article`` mappát az ``/opt/otrs/var/`` mappába vagy a rendszerbeállításokban megadott mappába.

source: Restore Already Installed Default Statistics
de: Bereits installierte Standardstatistik wiederherstellen
hu: A már telepített alapértelmezett statisztikák visszaállítása

source: If you have additional packages with default statistics you have to restore the stats XML files with the suffix ``*.installed`` to ``/opt/otrs/var/stats``.
de: Wenn Sie zusätzliche Pakete mit Standardstatistiken haben, müssen Sie die XML-Statistikdateien mit dem Suffix ``*.installed`` in ``/opt/otrs/var/stats`` wiederherstellen.
hu: Ha alapértelmezett statisztikákkal rendelkező további csomagjai vannak, akkor vissza kell állítania a statisztikák XML-fájljait az ``*.installed`` utótaggal az ``/opt/otrs/var/stats`` mappába.

source: Set File Permissions
de: Dateiberechtigungen festlegen
hu: Fájljogosultságok beállítása

source: Install Required Programs and Perl Modules
de: Erforderliche Programme und Perl-Module installieren
hu: Szükséges programok és Perl-modulok telepítése

source: Please refer to the section :ref:`Step 2: Install Additional Programs and Perl Modules` in the installation guide that explains how to verify external dependencies such as Perl modules and Node.js.
de: Bitte beachten Sie den Abschnitt :ref:`Step 2: Install Additional Programs and Perl Modules` im Installationshandbuch, in dem erläutert wird, wie externe Abhängigkeiten wie Perl-Module und Node.js überprüft werden.
hu: Nézze meg a :ref:`Step 2: Install Additional Programs and Perl Modules` szakaszt a telepítési útmutatóban, amely elmagyarázza, hogy hogyan kell ellenőrizni a külső függőségeket, mint például a Perl-modulokat és a Node.js-t.

source: In addition to that, OTRS 7 also requires an active cluster of Elasticsearch 6.0 or higher. Please refer to the :ref:`Step 8: Setup Elasticsearch Cluster` section in the installation guide.
de: Darüber hinaus erfordert OTRS 7 auch einen aktiven Cluster von Elasticsearch 6.0 oder höher. Weitere Informationen finden Sie in der Installationsanleitung im Abschnitt: :ref:`Step 8: Setup Elasticsearch Cluster`.
hu: Ezenkívül az OTRS 7-nek szüksége van egy Elasticsearch 6.0 vagy újabb verziójú aktív fürtre. Nézze meg a :ref:`Step 8: Setup Elasticsearch Cluster` szakaszt a telepítési útmutatóban.

source: Step 4: Run the Migration Script
de: Schritt 4: Migrationsskript ausführen
hu: 4. lépés: a költöztető parancsfájl futtatása

source: The migration script will perform many checks on your system and give you advice on how to install missing Perl modules etc., if that is required. If all checks succeeded, the necessary migration steps will be performed. Please also run this script in case of patch level updates.
de: Das Migrationsskript führt viele Überprüfungen auf Ihrem System durch und gibt Ihnen Hinweise, wie Sie fehlende Perl-Module usw. installieren, falls dies erforderlich ist. Wenn alle Prüfungen erfolgreich waren, werden die erforderlichen Migrationsschritte ausgeführt. Bitte führen Sie dieses Skript auch für Updates auf Patch-Ebene aus.
hu: A frissítő parancsfájl számos ellenőrzést fog végrehajtani a rendszerén, és tanácsot ad azzal kapcsolatban, hogy hogyan telepítse a hiányzó Perl-modulokat, stb., ha az szükséges. Ha sz összes ellenőrzés sikeres, akkor a szükséges költöztető lépések végre lesznek hajtva. Futtassa ezt a parancsfájlt hibajavító szintű frissítések esetén is.

source: Run the migration script:
de: Migrationsskript ausführen:
hu: Futtassa a költöztető parancsfájlt:

source: Do not continue the upgrading process if this script did not work properly for you. Otherwise malfunction or data loss may occur.
de: Setzen Sie den Aktualisierungsvorgang nicht fort, wenn dieses Skript nicht ordnungsgemäß für Sie funktioniert hat. Andernfalls können Fehlfunktionen oder Datenverlust auftreten.
hu: Ne folytassa a frissítési folyamatot, ha ez a parancsfájl nem működött megfelelően Önnél. Egyébként hibás működés vagy adatvesztés történhet.

source: The migration script also checks if ACLs and system configuration settings are correct. In case of an invalid system configuration setting, script will offer you an opportunity to fix it by choosing from a list of possible values. In case the script runs in a non-interactive mode, it will try to automatically fix invalid settings. If this fails, you will be asked to manually update the setting after the migration.
de: Das Migrationsskript überprüft auch, ob ACLs und Systemkonfigurationseinstellungen korrekt sind. Im Falle einer ungültigen Systemkonfigurationseinstellung bietet das Skript eine Möglichkeit zur Korrektur, indem es aus einer Liste möglicher Werte ausgewählt wird. Wenn das Skript in einem nicht interaktiven Modus ausgeführt wird, werden ungültige Einstellungen automatisch korrigiert. Wenn dies fehlschlägt, werden Sie aufgefordert, die Einstellung nach der Migration manuell zu aktualisieren.
hu: A költöztető parancsfájl azt is ellenőrzi, hogy az ACL-ek és a rendszerbeállítások helyesek-e. Bármilyen érvénytelen rendszerbeállítási érték esetén a parancsfájl fel fog ajánlani egy lehetőséget annak javításához a lehetséges értékek egy listából való kiválasztásával. Abban az esetben, ha a parancsfájl nem interaktív módban fut, megpróbálja automatikusan javítani az érvénytelen beállításokat. Ha ez meghiúsul, akkor arra fogja kérni, hogy kézzel frissítse a beállításokat a költöztetés után.

source: If there are outdated ACLs, the system will not be able to fix them automatically, and they need to be corrected by the administrator. Please see the last step for manual changes for details.
de: Wenn veraltete ACLs vorhanden sind, kann das System sie nicht automatisch korrigieren. Sie müssen vom Administrator korrigiert werden. Weitere Informationen finden Sie im letzten Schritt für manuelle Änderungen.
hu: Ha elavult ACL-ek találhatók, akkor a rendszer nem lesz képes automatikusan javítani, hanem az adminisztrátornak kell javítania azokat. A részletekért nézze meg az utolsó lépést a kézi változtatáshoz.

source: Step 5: Update Installed Packages
de: Schritt 5: Installierte Pakete aktualisieren
hu: 5. lépés: telepített csomagok frissítése

source: Packages for OTRS 6 are not compatible with OTRS 7 and have to be updated.
de: Pakete für OTRS 6 sind nicht kompatibel mit OTRS 7 und müssen aktualisiert werden.
hu: Az OTRS 6 csomagjai nem kompatibilisek az OTRS 7-tel, és frissíteni kell azokat.

source: You can use the command below to update all installed packages. This works for all packages that are available from online repositories. You can update other packages later via the package manager (this requires a running OTRS daemon).
de: Sie können den folgenden Befehl verwenden, um alle installierten Pakete zu aktualisieren. Dies funktioniert für alle Pakete, die in Online-Repositorys verfügbar sind. Sie können andere Pakete später über den Paketmanager aktualisieren (dies erfordert einen laufenden OTRS-Daemon).
hu: Használhatja a lenti parancsot az összes telepített csomag frissítéséhez. Ez működik az összes olyan csomagnál, amely elérhető az internetes tárolókból. Az egyéb csomagokat frissítheti később is a csomagkezelőn keresztül (ez futó OTRS démont igényel).

source: Step 6: Restart your Services
de: Schritt 6: Dienste neustarten
hu: 6. lépés: szolgáltatások újraindítása

source: OTRS 7 comes with an own built-in web server that is used behind Apache as a reverse proxy (or any other reverse proxy server). For major update from OTRS 6, the Apache configuration must be updated with the new version in ``/opt/otrs/scripts/apache2-httpd.include.conf``, if it was copied and not just linked.
de: OTRS 7 wird mit einem eigenen Webserver geliefert, der hinter Apache als Reverse-Proxy (oder einen anderen Reverse-Proxy-Server) verwendet wird. Für ein Major Update von OTRS 6 muss die Apache-Konfiguration mit der neuen Version in ``/opt/otrs/scripts/apache2-httpd.include.conf`` aktualisiert werden, wenn sie kopiert und nicht nur verlinkt wurde.
hu: Az OTRS 7 saját beépített webkiszolgálóval érkezik, amely az Apache fordított proxyként (vagy bármely más fordított proxy kiszolgálóként) történő használata mögött található. Az OTRS 6-ról történő főverzió frissítésnél az Apache beállításait frissíteni kell az ``/opt/otrs/scripts/apache2-httpd.include.conf`` fájlban lévő új verzióval, ha az másolva volt és nem csak hivatkozva.

source: Please also note that while ``mod_perl`` is no longer needed, other Apache modules are required now: ``proxy_module``, ``proxy_http_module`` and ``proxy_wstunnel_module``.
de: Bitte beachten Sie auch, dass, während ``mod_perl`` nicht mehr benötigt wird, jetzt andere Apache-Module erforderlich sind: ``proxy_module``, ``proxy_http_module`` und ``proxy_wstunnel_module``.
hu: Ne feledje azt sem, hogy míg a ``mod_perl`` többé nem szükséges, egyéb Apache-modulok szükségesek most: ``proxy_module``, ``proxy_http_module`` és ``proxy_wstunnel_module``.

source: After that, the services can be restarted. This will depend on your service configuration, here is an example:
de: Danach können die Dienste neu gestartet werden. Dies hängt von Konfiguration Ihrer Dienste ab. Hier ein Beispiel:
hu: Ezután a szolgáltatások újraindíthatók. Ez a szolgáltatás beállításaitól függ, itt egy példa:

source: The OTRS daemon is required for correct operation of OTRS such as sending emails. Please activate it as described in the next step.
de: Der OTRS Daemon ist für den korrekten Betrieb von OTRS erforderlich, beispielsweise für das Senden von E-Mails. Bitte aktivieren Sie den Daemon wie im nächsten Schritt beschrieben.
hu: Az OTRS démon szükséges az OTRS helyes működéséhez, mint például e-mailek küldéséhez. Kapcsolja be a következő lépésben leírtak szerint.

source: Step 7: Start the OTRS Daemon, Web Server and Cron Job
de: Schritt 7: OTRS Daemon, Webserver und Cron-Job starten
hu: 7. lépés: az OTRS démon, webkiszolgáló és a cron-feladat elindítása

source: The OTRS daemon is responsible for handling any asynchronous and recurring tasks in OTRS. The daemon and its keepalive cron job must be started as the ``otrs`` user. The built-in OTRS web server process handles the web requests handed over from Apache.
de: Der OTRS-Daemon ist für die Behandlung asynchroner und wiederkehrender Aufgaben in OTRS verantwortlich. Der Daemon und sein keepalive Cron-Job müssen als ``otrs``-Benutzer gestartet werden. Der integrierte OTRS-Webserverprozess verarbeitet die von Apache übergebenen Webanforderungen.
hu: Az OTRS démon felelős bármely aszinkron és ismétlődő feladat kezelésénél az OTRS-ben. A démont és az életben tartó cron-feladatát az ``otrs`` felhasználóként kell elindítani. A beépített OTRS webkiszolgáló folyamat kezeli az Apache-tól megkapott webkéréseket.

source: Now you can log into your system.
de: Jetzt können Sie sich in Ihrem System anmelden.
hu: Most már bejelentkezhet a rendszerre.

source: Step 8: Manual Migration Tasks and Changes
de: Schritt 8: Manuelle Migrationsaufgaben und -änderungen
hu: 8. lépés: feladatok és változtatások kézi költöztetése

source: This step is required only for major update from OTRS 6.
de: Dieser Schritt ist nur für ein Major Update von OTRS 6 erforderlich.
hu: Ez a lépés csak az OTRS 6-ról történő főverzió-frissítésnél szükséges.

source: Since the old customer interface screens are no longer present, some ACLs need to be corrected manually by the administrator. The migration script already informed you if this is the case.
de: Da die alten Bildschirmmasken der Kundenoberfläche nicht mehr vorhanden sind, müssen einige ACLs vom Administrator manuell korrigiert werden. Das Migrationsskript hat Sie bereits informiert, wenn dies der Fall ist.
hu: Mivel a régi ügyfélfelület képernyői többé nincsenek meg, néhány ACL-t kézzel kell javítania az adminisztrátornak. A költöztető parancsfájl már tájékoztatta Önt, ha ez az eset áll fenn.

source: Affected ACLs are those that refer to a non-existing customer interface screen in their ``Action`` setting. This front end ``Action`` rule needs to be replaced with a corresponding ``Endpoint`` rule. A table with possible mapping is included below.
de: Betroffene ACLs sind solche, die sich auf eine nicht vorhandene Bildschirmmaske für die Kundenoberfläche in ihrer "Action"-Einstellung beziehen. Diese Frontend-Regel muss durch eine entsprechende ``Endpunkt``-Regel ersetzt werden. Eine Tabelle mit möglicher Zuordnung finden Sie nachfolgend.
hu: Azok az ACL-ek érintettek, amelyek egy nemlétező ügyfélfelület képernyőre hivatkoznak az ``Action`` beállításban. Ezt az előtétprogram ``Action`` szabályt kell kicserélni a megfelelő ``Endpoint`` szabállyal. Alább egy táblázat látható a lehetséges leképezésekkel.

source: Action
de: Aktion
hu: Művelet

source: Endpoint
de: Endpunkt
hu: Végpont

source: No replacement (feature dropped)
de: Kein Ersatz (Funktion entfällt)
hu: Nincs helyettesítés (a funkció el lett dobva)

source: ``ExternalFrontend::ProcessTicketCreate`` or ``ExternalFrontend::ProcessTicketNextStep``
de: ``ExternalFrontend::ProcessTicketCreate`` oder ``ExternalFrontend::ProcessTicketNextStep``
hu: ``ExternalFrontend::ProcessTicketCreate`` vagy ``ExternalFrontend::ProcessTicketNextStep``

source: ``Ticket::SearchIndex::Filters`` Setting
de: ``Ticket::SearchIndex::Filters`` Einstellung
