Repository: ShawnBeasleyOTRS/doc-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de, hu

source: Backup and Restore
de: Sichern und Wiederherstellen
hu: Biztonsági mentés és visszaállítás

source: OTRS has built-in scripts for backup and restore. Execute the scripts with ``-h`` option for more information.
de: OTRS verfügt über integrierte Skripte zum Sichern und Wiederherstellen. Führen Sie die Skripte mit der Option ``-h`` aus, um weitere Informationen zu erhalten.
hu: Az OTRS tartalmaz beépített parancsfájlokat a biztonsági mentéshez és visszaállításhoz. További információkért futtassa a parancsfájlokat a ``-h`` kapcsolóval.

source: Backup
de: Datensicherung
hu: Biztonsági mentés

source: To create a backup, write permission is needed for ``otrs`` user for the destination directory.
de: Um eine Datensicherung zu erstellen, werden Schreibrechte für den ``otrs`` Benutzer im Zielverzeichnis benötigt.
hu: Biztonsági mentés készítéséhez írási jogosultságra van szüksége az ``otrs`` felhasználónak a célkönyvtárra.

source: The output of the script:
de: Die Ausgabe des Skripts:
hu: A parancsfájl kimenete:

source: Restore
de: Wiederherstellen
hu: Visszaállítás

source: OTRS Installation Guide
de: OTRS Installationsanleitung
hu: OTRS telepítési útmutató

source: This work is copyrighted by OTRS AG (https://otrs.com), Zimmersmühlenweg 11, 61440 Oberursel, Germany.
de: Dieses Werk ist urheberrechtlich geschützt von der OTRS AG (https://otrs.com), Zimmersmühlenweg 11, 61440 Oberursel, Deutschland.
hu: Ez a mű az OTRS AG (https://otrs.com), Zimmersmühlenweg 11, 61440 Oberursel, Németország szerzői joga alatt áll.

source: Permission is granted to copy, distribute and/or modify this document under the terms of the GNU Free Documentation License, Version 1.3 or any later version published by the Free Software Foundation; with no Invariant Sections, no Front-Cover Texts, and no Back-Cover Texts. A copy of the license can be found on the `GNU website <https://www.gnu.org/licenses/fdl-1.3.txt>`__.
de: Es ist erlaubt, dieses Dokument zu kopieren, verteilen und zu verändern unter Beachtung der Bedingungen der GNU Lizens für freie Dokumentationen, Version 1.3 oder höher; ohne invariante Abschnitte, keine Titelseiten-Texte und keine Rückseiten-Texte. Eine Kopie der Lizenz finden Sie auf der `GNU website <https://www.gnu.org/licenses/fdl-1.3.txt>`__.
hu: Engedélyt adunk Önnek a jelen dokumentum sokszorosítására, terjesztésére és/vagy módosítására a Free Software Foundation által kiadott GNU Free Documentation License 1.3-as, vagy bármely azt követő verziójának feltételei alapján. Nincs Nem Változtatható szakasz, nincs Címlapszöveg, nincs Hátlapszöveg. A jelen licenc egy példányát a `GNU weboldalán <https://www.gnu.org/licenses/fdl-1.3.txt>`__ találja.

source: Contents
de: Inhalte
hu: Tartalom

source: Installation
hu: Telepítés

source: This chapter describes the installation and basic configuration of the central OTRS framework.
de: Dieses Kapitel beschreibt die Installation und die grundlegende Einrichtung des zentralen OTRS-Framework.
hu: Ez a fejezet a központi OTRS keretrendszer telepítését és alapvető beállítását mutatja be.

source: Follow the detailed steps in this chapter to install OTRS on your server. You can then use its web interface to login and administer the system.
de: Folgen Sie den Schritten in diesem Kapitel, um OTRS auf Ihrem Server zu installieren. Dann können Sie sich über die Weboberfläche anmelden und das System administrieren.
hu: Kövesse az ebben a fejezetben lévő részletes lépéseket az OTRS telepítéséhez a kiszolgálóra. Ezután használhatja a webes felületét a bejelentkezéshez és a rendszer adminisztrálásához.

source: Preparation: Disable SELinux
de: Vorbereitung: SELinux deaktivieren
hu: Előkészítés: SELinux letiltása

source: If your system uses SELinux, you should disable it, otherwise OTRS will not work correctly.
de: Wenn Ihr System SELinux benutzt, sollten Sie es deaktivieren. Andernfalls wird OTRS nicht korrekt funktionieren.
hu: Ha a rendszere SELinuxot használ, akkor le kell tiltania azt, különben az OTRS nem fog megfelelően működni.

source: Here's how to disable SELinux for RHEL/CentOS/Fedora.
de: Hier finden Sie Informationen, wie Sie SELinux für RHEL/CentOS/Fedora deaktiveren können.
hu: Itt láthatja, hogyan kell letiltani a SELinuxot RHEL/CentOS/Fedora rendszereken.

source: Configure ``SELINUX=disabled`` in the ``/etc/selinux/config`` file:
de: Konfigurieren Sie ``SELINUX=disabled`` in der Datei ``etc/selinux/config`` :
hu: Állítsa be a ``SELINUX=disabled`` értéket az ``/etc/selinux/config`` fájlban:

source: Reboot your system. After reboot, confirm that the ``getenforce`` command returns *Disabled*:
de: Starten Sie Ihr System neu. Vergewissern Sie sich nach dem Neustart, dass der Befehl ``getenforce`` *Disabled* zurückgibt:
hu: Indítsa újra a rendszert. Újraindítás után ellenőrizze, hogy a ``getenforce`` parancs *Disabled* értéket ad-e vissza:

source: Step 1: Unpack and Install the Application
de: Schritt 1: Anwendung entpacken und installieren
hu: 1. lépés: az alkalmazás kibontása és telepítése

source: You can obtain either ``otrs-x.y.z.tar.gz`` or ``otrs-x.y.z.tar.bz2``. Unpack the source archive (for example, using ``tar``) into the directory ``/opt``, and create a symbolic link ``/opt/otrs`` that points to ``/opt/otrs-x.y.z``. **Do not forget** to replace the version numbers!
de: Sie haben nach dem Download entweder ``otrs-x.y.z.tar.gz`` oder ``otrs-x.y.z.tar.bz2`` erhalten. Entpacken Sie das Quellarchiv (zum Beispiel mit ``tar``) in das Verzeichnis ``/opt`` und erstellen Sie einen symbolischen Link ``/opt/otrs``, der auf ``/opt/otrs-xyzverweist``. **Vergessen Sie nicht**, die Versionsnummern zu ersetzen!
hu: Beszerezheti akár az ``otrs-x.y.z.tar.gz`` vagy az ``otrs-x.y.z.tar.bz2`` fájlt is. Bontsa ki a forrásarchívumot (például a ``tar`` használatával) az ``/opt`` könyvtárba, és hozzon létre egy ``/opt/otrs`` szimbolikus hivatkozást, amely az ``/opt/otrs-x.y.z`` helyre mutat. **Ne felejtse el** kicserélni a verziószámokat!

source: Package ``bzip2`` is not installed in some systems by default. Make sure, that ``bzip2`` is installed before unpacking ``otrs-x.y.z.tar.bz2``.
de: Das Paket ``bzip2`` ist in einigen Systemen standardmäßig nicht installiert. Stellen Sie sicher, dass ``bzip2`` installiert ist, bevor Sie ``otrs-x.y.z.tar.bz2`` entpacken.
hu: A ``bzip2`` csomag néhány rendszeren nincs alapértelmezetten telepítve. Győződjön meg arról, hogy a ``bzip2`` telepítve van-e, mielőtt az ``otrs-x.y.z.tar.bz2`` fájlt kibontaná.

source: Unpack command for ``otrs-x.y.z.tar.gz``:
de: Kommando zum Entpacken für ``otrs-x.y.z.tar.gz``:
hu: Kibontási parancs az ``otrs-x.y.z.tar.gz`` fájlhoz:

source: Unpack command for ``otrs-x.y.z.tar.bz2``:
de: Kommando zum Entpacken für ``otrs-x.y.z.tar.bz2``:
hu: Kibontási parancs az ``otrs-x.y.z.tar.bz2`` fájlhoz:

source: It is recommended to create a symbolic link named ``/opt/otrs`` that always points to the latest OTRS version. Using symbolic link makes easy to manage the OTRS updates, because you can leave untouched the directory of the previous version, only the symbolic link needs to change. If you need to revert the update, you can change the target of the symbolic link back.
de: Es wird empfohlen, einen symbolischen Link mit dem Namen ``/opt/otrs`` zu erstellen, der immer auf die neueste OTRS-Version verweist. Die Verwendung eines symbolischen Links erleichtert die Verwaltung der OTRS-Updates, da Sie das Verzeichnis der vorherigen Version nicht ändern müssen. Lediglich der symbolische Link muss geändert werden. Wenn Sie das Update zurücksetzen müssen, können Sie das Ziel des symbolischen Links wieder ändern.
hu: Ajánlott egy ``/opt/otrs`` nevű szimbolikus hivatkozást létrehozni, amely mindig a legújabb OTRS verzióra mutat. A szimbolikus hivatkozás használata egyszerűvé teszi az OTRS frissítések kezelését, mert így érintetlenül hagyhatja az előző verzió könyvtárát, mindössze a szimbolikus hivatkozást kell megváltoztatni. Ha vissza kell vonnia a frissítést, akkor visszaváltoztathatja a szimbolikus hivatkozás célját a korábbi könyvtárra.

source: Execute this command to create a symbolic link:
de: Führen Sie diesen Befehl aus, um einen symbolischen Link zu erstellen:
hu: Futtassa ez a parancsot egy szimbolikus hivatkozás létrehozásához:

source: Step 2: Install Additional Programs and Perl Modules
de: Schritt 2: Zusätzliche Programme und Perl-Module installieren
hu: 2. lépés: további programok és Perl-modulok telepítése

source: Use the following script to get an overview of all installed and required CPAN modules and other external dependencies.
de: Verwenden Sie das folgende Skript, um einen Überblick über alle installierten und erforderlichen CPAN-Module und andere externe Abhängigkeiten zu erhalten.
hu: Használja a következő parancsfájlt, hogy áttekintést kapjon az összes telepített és szükséges CPAN-modulról és egyéb külső függőségekről.

source: Please note that OTRS requires a working Perl installation with all *core* modules such as the module ``version``. These modules are not explicitly checked by the script. You may need to install a ``perl-core`` package on some systems like RHEL that do not install the Perl core packages by default.
de: Bitte beachten Sie, dass OTRS eine funktionierende Perl-Installation mit allen *core* Modulen wie dem Modul ``version`` erfordert. Diese Module werden vom Skript nicht explizit geprüft. Auf einigen Systemen wie RHEL, die die Perl-Core-Pakete standardmäßig nicht installieren, müssen Sie möglicherweise ein ``perl-core``-Paket installieren.
hu: Ne feledje, hogy az OTRS-hez működő Perl-telepítés szükséges az összes *alapvető* modullal, mint például a ``version`` modul. Ezeket a modulokat közvetlenül nem ellenőrzi a parancsfájl. Esetleg telepítenie kell egy ``perl-core`` csomagot néhány olyan rendszeren, mint például a RHEL, amely nem telepíti az alapvető Perl-csomagokat alapértelmezetten.

source: To install the required and optional packages, you can use either CPAN or the package manager of your Linux distribution.
de: Um die erforderlichen und optionalen Pakete zu installieren, können Sie entweder CPAN oder den Paketmanager Ihrer Linux-Distribution verwenden.
hu: A szükséges és választható csomagok telepítéséhez használhatja a CPAN-t vagy a Linux disztribúciója csomagkezelőjét is.

source: Execute this command to get an install command to install the missing dependencies:
de: Führen Sie diesen Befehl aus, um einen Installationsbefehl zum Installieren der fehlenden Abhängigkeiten zu erhalten:
hu: Futtassa ezt a parancsot, hogy megkapjon egy telepítési parancsot a hiányzó függőségek telepítéséhez:

source: OTRS requires a supported stable version of Node.js to be installed. Please refer to the `Node.js installation instructions <https://nodejs.org/en/download/package-manager/>`__.
de: Für OTRS muss eine unterstützte stabile Version von Node.js installiert werden. Bitte beachten Sie die `Node.js installation instructions <https://nodejs.org/en/download/package-manager/>`__.
hu: Az OTRS-hez szükséges, hogy a Node.js egy támogatott stabil verziója telepítve legyen. Nézze meg a `Node.js telepítési utasításait <https://nodejs.org/en/download/package-manager/>`__.

source: Step 3: Create the OTRS User
de: Schritt 3: Einen OTRS-Benutzer erstellen
hu: 3. lépés: az OTRS Felhasználó létrehozása

source: Create a dedicated user for OTRS:
de: Einen dedizierten Benutzer für OTRS erstellen:
hu: Hozzon létre egy dedikált felhasználót az OTRS-hez:

source: Step 4: Activate the Default Configuration File
de: Schritt 4: Standard-Konfigurationsdatei aktivieren
hu: 4. lépés: az alapértelmezett beállítófájl aktiválása

source: There is an OTRS configuration file bundled in ``$OTRS_HOME/Kernel/Config.pm.dist``. You must activate it by copying it without the ``.dist`` filename extension.
de: Es gibt eine gepackte OTRS-Konfigurationsdatei in ``$OTRS_HOME/Kernel/Config.pm.dist``. Sie müssen sie aktivieren, indem Sie die Datei ohne die Dateinamenerweiterung ``.dist`` kopieren.
hu: Van egy OTRS beállítófájl az ``$OTRS_HOME/Kernel/Config.pm.dist`` fájlba csomagolva. Aktiválnia kell a ``.dist`` fájlnévkiterjesztés nélkül történő lemásolással.

source: Step 5: Configure the Apache Web Server
de: Schritt 5: Apache-Webserver konfigurieren
hu: 5. lépés: az Apache webkiszolgáló beállítása

source: OTRS comes with an own built-in web server that is used behind Apache as a reverse proxy (or any other reverse proxy server). A few Apache modules are needed for correct operation: ``proxy_module``, ``proxy_http_module`` and ``proxy_wstunnel_module``.
de: OTRS wird mit einem eigenen Webserver geliefert, der hinter Apache als Reverse Proxy (oder einen anderen Reverse Proxy-Server) verwendet wird. Für den korrekten Betrieb sind einige Apache-Module erforderlich: ``proxy_module``, ``proxy_http_module`` und ``proxy_wstunnel_module``.
hu: Az OTRS saját beépített webkiszolgálóval érkezik, amely az Apache fordított proxyként (vagy bármely más fordított proxy kiszolgálóként) történő használata mögött található. Néhány Apache-modul szükséges a helyes működéshez: ``proxy_module``, ``proxy_http_module`` és ``proxy_wstunnel_module``.

source: On some systems like Debian and SuSE, these modules need to be specifically enabled:
de: Auf einigen Systemen wie Debian und SuSE müssen diese Module speziell aktiviert werden:
hu: Néhány rendszeren, mint például Debian és SuSE használatakor, ezeket a modulokat kifejezetten engedélyezni kell:

source: Most Apache installations have a ``conf.d`` directory included. On Linux systems you can usually find this directory under ``/etc/apache`` or ``/etc/apache2``. Log in as root, change to the ``conf.d`` directory and link the appropriate template in ``/opt/otrs/scripts/apache2-httpd.include.conf`` to a file called ``zzz_otrs.conf`` in the Apache configuration directory (to make sure it is loaded after the other configurations).
de: Die meisten Apache-Installationen enthalten ein ``conf.d``-Verzeichnis. Auf Linux-Systemen finden Sie dieses Verzeichnis normalerweise unter ``/etc/apache`` oder ``/etc/apache2``. Melden Sie sich als root an, wechseln Sie in das Verzeichnis ``conf.d`` und verknüpfen Sie die entsprechende Vorlage in ``/opt /otrs/scripts/apache2-httpd.include.conf`` mit einer Datei mit dem Namen ``zzz_otrs.conf`` im Apache-Konfigurationsverzeichnis (um sicherzustellen, dass es nach den anderen Konfigurationen geladen wird).
hu: A legtöbb Apache telepítés rendelkezik egy ``conf.d`` könyvtárral. A Linux rendszereken általában az ``/etc/apache`` vagy ``/etc/apache2`` könyvtárakban találja meg ezt a könyvtárat. Jelentkezzen be rendszergazdaként, lépje be a ``conf.d`` könyvtárba, és linkelje a megfelelő sablonokat az ``/opt/otrs/scripts/apache2-httpd.include.conf`` fájlban a ``zzz_otrs.conf`` nevű fájlra az Apache beállítási könyvtárában (hogy biztos legyen abban, hogy betöltődnek az egyéb beállítások után).

source: Now you can restart your web server to load the new configuration settings. On most systems you can do that with the command:
de: Jetzt können Sie Ihren Webserver neu starten, um die neuen Konfigurationseinstellungen zu laden. Auf den meisten Systemen können Sie dies mit diesem Befehl ausführen:
hu: Most már újraindíthatja a webkiszolgálót az új konfigurációs beállítások betöltéséhez. A legtöbb rendszeren ezt ezzel a paranccsal teheti meg:

source: Step 6: Set File Permissions
de: Schritt 6: Dateiberechtigungen festlegen
hu: 6. lépés: fájljogosultságok beállítása

source: Please execute the following command to set the file and directory permissions for OTRS. It will try to detect the correct user and group settings needed for your setup.
de: Führen Sie den folgenden Befehl aus, um die Datei- und Verzeichnisberechtigungen für OTRS festzulegen. Es wird versucht, die richtigen Gruppen- und Benutzereinstellungen zu ihrem Setup zu ermitteln.
hu: Futtassa a következő parancsot a fájl- és könyvtárjogosultságok beállításához az OTRS számára. Megpróbálja felismerni a beállításhoz szükséges helyes felhasználó- és csoportbeállításokat.

source: Step 7: Setup the Database
de: Schritt 7: Die Datenbank einrichten
hu: 7. lépés: az adatbázis beállítása

source: The following steps need to be taken to setup the database for OTRS properly:
de: Die folgenden Schritte müssen ausgeführt werden, um die Datenbank für OTRS ordnungsgemäß einzurichten:
hu: A következő lépéseket szükséges elvégezni az adatbázis megfelelő beállításához az OTRS számára:

source: Create a dedicated database user and database.
de: Einen dedizierten Datenbank-Benutzer und eine Datenbank erstellen.
hu: Hozzon létre egy dedikált adatbázis-felhasználót és adatbázist.

source: Create the database structure.
de: Datenbank-Struktur erstellen.
hu: Hozza létre az adatbázis szerkezetét.

source: Insert the initial data.
de: Initiale Daten einfügen.
hu: Szúrja be a kezdeti adatokat.

source: Configure the database connection in ``Kernel/Config.pm``.
de: Datenbank-Verbindung in ``Kernel/Config.pm`` konfigurieren.
hu: Állítsa be az adatbázis-kapcsolatot a ``Kernel/Config.pm`` fájlban.

source: Please note that OTRS requires ``utf8`` as database storage encoding.
de: Beachten Sie bitte, dass OTRS ``utf8`` zur Speichercodierung der Datenbank benötigt.
hu: Ne feledje, hogy az OTRS-nek ``utf8`` adatbázistároló-kódolásra van szüksége.

source: MySQL or MariaDB
de: MySQL oder MariaDB
hu: MySQL vagy MariaDB

source: Log in to MySQL console as database admin user:
de: Loggen Sie sich in die MySQL-Konsole als Datenbank Admin-Benutzer ein:
hu: Lépjen be a MySQL konzolba adatbázis-adminisztrátor felhasználóként:

source: Create a database:
de: Datenbank erstellen:
hu: Hozzon létre egy adatbázist:

source: Special database user handling is needed for MySQL 8, as the default ``caching_sha2_password`` can only be used over secure connections. Create a database user in MySQL 8:
de: Für MySQL 8 ist eine besondere Handhabung der Datenbank-Benutzer erforderlich, da das Standard-``caching_sha2_password`` nur für sichere Verbindungen verwendet werden kann. Erstellen Sie einen Datenbank-Benutzer in MySQL 8:
hu: Különleges adatbázisfelhasználó-kezelés szükséges a MySQL 8-nál, mivel az alapértelmezett ``caching_sha2_password`` csak biztonságos kapcsolatokon keresztül használható. Hozzon létre egy adatbázis-felhasználót a MySQL 8-ban:

source: Create a database user in older MySQL versions:
de: Erstellen eines Datenbank-Benutzers in älteren MySQL Versionen:
hu: Hozzon létre egy adatbázis-felhasználót a régebbi MySQL verziókban:

source: Assign user privileges to the new database:
de: Weisen Sie der neuen Datenbank Benutzerberechtigungen zu:
hu: Rendeljen felhasználói jogosultságokat az új adatbázishoz:

source: Run the following commands on the shell to create schema and insert data:
de: Führen Sie die folgenden Befehle in der Shell aus, um ein Schema zu erstellen und Daten einzufügen:
hu: Futtassa a következő parancsokat a parancsértelmezőben a séma létrehozásához és az adatok beszúrásához:

source: Configure database settings in ``Kernel/Config.pm``:
de: Konfigurieren Sie die Datenbank-Einstellungen in ``Kernel/Config.pm``:
hu: Állítsa be az adatbázis beállításait a ``Kernel/Config.pm`` fájlban:

source: The following configuration settings are recommended for MySQL setups. Please add the following lines to ``/etc/my.cnf`` under the ``[mysqld]`` section:
de: Die folgenden Einstellungen zur Konfiguration werden für MySQL-Setups empfohlen. Fügen Sie bitte folgende Zeilen in ``/etc/my.cnf`` unterhalb des Abschnitts ``[mysqld]`` ein:
hu: A következő konfigurációs beállítások ajánlottak a MySQL telepítéseknél. Adja hozzá a következő sorokat az ``/etc/my.cnf`` fájlhoz a ``[mysqld]`` szakasz alá:

source: We assume, that OTRS and PostgreSQL server run on the same machine and PostgreSQL uses *Peer* authentication method. For more information see the `Client Authentication <https://www.postgresql.org/docs/current/client-authentication.html>`__ section in the PostgreSQL manual.
de: Wir gehen davon aus, dass OTRS und PostgreSQL-Server auf demselben Rechner laufen und PostgreSQL die Authentifizierungsmethode *Peer* verwendet. Weitere Informationen finden Sie im Abschnitt `Client-Authentifizierung <https://www.postgresql.org/docs/current/client-authentication.html>`__ im PostgreSQL-Handbuch.
hu: Feltételezzük, hogy az OTRS és a PostgreSQL kiszolgáló ugyanazon a gépen fut, és a PostgreSQL *Peer* hitelesítési módszert használ. További információkért nézze meg a `Client Authentication <https://www.postgresql.org/docs/current/client-authentication.html>`__ szakaszt a PostgreSQL kézikönyvében.

source: Switch to ``postgres`` user:
de: Wechseln Sie zum Postgres-Benutzer:
hu: Lépjen át a ``postgres`` felhasználóra:

source: Create a database user:
de: Erstellen Sie einen Datenbank-Benutzer:
hu: Hozzon létre egy adatbázis-felhasználót:

source: Finishing the Database Setup
de: Datenbank-Setup abschließen
hu: Az adatbázis-beállítás befejezése

source: To verify your database setup, run the following command:
de: Führen Sie den folgenden Befehl aus, um Ihr Datenbank-Setup zu überprüfen:
hu: Az adatbázis-beállítás ellenőrzéséhez futtassa a következő parancsot:

source: Once the database is configured correctly, please initialize the system configuration with the following command:
de: Sobald die Datenbank korrekt konfiguriert ist, können Sie die Systemkonfiguration mit folgendem Befehl initialisieren:
hu: Amikor az adatbázis megfelelően be lett állítva, készítse elő a rendszerbeállításokat a következő paranccsal:

source: For security reasons, please change the default password of the admin user ``root@localhost`` by generating a random password:
de: Ändern Sie bitte aus Sicherheitsgründen das Standardkennwort des Admin-Benutzers ``root@localhost``, indem Sie ein zufälliges Passwort generieren:
hu: Biztonsági okokból változtassa meg a ``root@localhost`` adminisztrátor felhasználó jelszavát egy véletlen jelszó előállításával:

source: You can also choose to set your own password:
de: Sie können auch Ihr eigenes Passwort festlegen:
hu: Választhatja azt is, hogy saját jelszót állít be:

source: Step 8: Setup Elasticsearch Cluster
de: Schritt 8: Elasticsearch-Cluster einrichten
hu: 8. lépés: az Elasticsearch-fürt beállítása

source: OTRS requires an active cluster of Elasticsearch 6.0 or higher. The easiest way is to `setup Elasticsearch <https://www.elastic.co/guide/en/elasticsearch/reference/current/setup.html>`__ on the same host as OTRS and binding it to its default port. With that, no further configuration in OTRS is needed.
de: OTRS erfordert einen aktiven Cluster von Elasticsearch 6.0 oder höher. Der einfachste Weg ist, `Elasticsearch <https://www.elastic.co/guide/en/elasticsearch/reference/current/setup.html>`__ auf demselben Host wie OTRS einzurichten und an seinen Standardport zu binden. Damit ist keine weitere Konfiguration in OTRS erforderlich.
hu: Az OTRS-hez egy aktív Elasticsearch-fürt 6.0 vagy újabb szükséges. A legegyszerűbb mód az `Elasticsearch beállítása <https://www.elastic.co/guide/en/elasticsearch/reference/current/setup.html>`__ ugyanarra a gépre, amelyen az OTRS van, és hozzákapcsolni azt az alapértelmezett porthoz. Ezzel az OTRS-ben nincs szükség további beállításokra.

source: Additionally, OTRS requires plugins to be installed into Elasticsearch:
de: Zusätzlich erfordert OTRS, dass Plugins in Elasticsearch installiert werden:
hu: Továbbá az OTRS-nek szüksége van bővítmények telepítésére az Elasticsearch-fürtbe:

source: Restart Elasticsearch afterwards, or indexes will not be built.
de: Starten Sie Elasticsearch anschließend neu, da sonst keine Indizes aufgebaut werden.
hu: Ezután indítsa újra az Elasticsearch programot, különben az indexek nem lesznek felépítve.
