Repository: ShawnBeasleyOTRS/doc-installation
Catalog: locale/*/LC_MESSAGES/content.po
Languages: de, hu

source: To verify the Elasticsearch installation, you can use the following command:
de: Um die Installation von Elasticsearch zu überprüfen, können Sie den folgenden Befehl verwenden:
hu: Az Elasticsearch telepítés ellenőrzéséhez használhatja a következő parancsot:

source: Step 9: Start the OTRS Daemon and Web Server
de: Schritt 9: OTRS Daemon und Webserver starten
hu: 9. lépés: az OTRS démon és webkiszolgáló elindítása

source: The new OTRS daemon is responsible for handling any asynchronous and recurring tasks in OTRS. The built-in OTRS web server process handles the web requests handed over from Apache. Both processes must be started from the ``otrs`` user.
de: Der neue OTRS-Daemon ist für die Behandlung asynchroner und wiederkehrender Aufgaben in OTRS verantwortlich. Der integrierte OTRS-Webserverprozess verarbeitet die von Apache übergebenen Webanforderungen. Beide Prozesse müssen vom ``otrs``-Benutzer aus gestartet werden.
hu: Az új OTRS démon felelős minden aszinkron és ismétlődő feladat kezeléséért az OTRS-ben. A beépített OTRS webkiszolgáló-folyamat kezeli az Apache által átadott webkéréseket. Mindkét folyamatot az ``otrs`` felhasználónak kell elindítania.

source: Step 10: First Login
de: Schritt 10: Die erste Anmeldung
hu: 10. lépés: első bejelentkezés

source: Now you are ready to login to your system at http://localhost/otrs/index.pl as user ``root@localhost`` with the password that was generated (see above).
de: Jetzt können Sie sich unter http://localhost/otrs/index.pl als Benutzer ``root@localhost`` mit dem generierten Kennwort anmelden (siehe oben).
hu: Most már készen áll, hogy bejelentkezzen a rendszerbe a http://localhost/otrs/index.pl címen a ``root@localhost`` felhasználóval és előállított jelszóval (lásd fentebb).

source: Use http://localhost to access the external interface.
de: Verwenden Sie http://localhost, um auf das externe Interface zuzugreifen.
hu: Használja a http://localhost címet a külső felület eléréséhez.

source: Step 11: Setup Systemd Files
de: Schritt 11: Systemd-Dateien einrichten
hu: 11. lépés: systemd fájlok beállítása

source: OTRS comes with example systemd configuration files that can be used to make sure that the OTRS daemon and web server are started automatically after the system starts.
de: OTRS enthält Beispiel Systemd-Konfigurationsdateien, mit denen sichergestellt werden kann, dass der OTRS-Daemon und der Webserver nach dem Systemstart automatisch gestartet werden.
hu: Az OTRS példa systemd beállítófájlokkal érkezik, amelyek ahhoz használhatók, hogy biztosítva legyen az OTRS démon és webkiszolgáló automatikus elindítása, miután a rendszer elindul.

source: With this step, the basic system setup is finished.
de: Nach diesem Schritt ist das Basis-Systemsetup beendet.
hu: Ezzel a lépéssel az alapvető rendszerbeállítás befejeződött.

source: Step 12: Setup Bash Auto-Completion (optional)
de: Schritt 12: Automatische Bash-Vervollständigung einrichten (optional)
hu: 12. lépés: bash automatikus kiegészítés beállítása (kihagyható)

source: All regular OTRS command line operations happen via the OTRS console interface. This provides an auto completion for the bash shell which makes finding the right command and options much easier.
de: Alle regulären OTRS-Befehlszeilenoperationen finden über die OTRS-Konsolenschnittstelle statt. Dies bietet eine automatische Vervollständigung der Bash-Shell, wodurch das Finden der richtigen Befehle und Optionen wesentlich vereinfacht wird.
hu: Az összes szokásos OTRS parancssori művelet az OTRS konzolfelületén keresztül történik. Ez automatikus kiegészítést biztosít a bash parancsértelmezőhöz, amely sokkal egyszerűbbé teszi a megfelelő parancs és kapcsolók megtalálását.

source: You can activate the bash auto-completion by installing the package ``bash-completion``. It will automatically detect and load the file ``/opt/otrs/.bash_completion`` for the ``otrs`` user.
de: Sie können die automatische Vervollständigung der Bash aktivieren, indem Sie das Paket ``bash-completion`` installieren. Das Feature erkennt und lädt automatisch die Datei ``/opt/otrs/.bash_completion`` für den ``otrs``-Benutzer.
hu: Aktiválhatja a bash automatikus kiegészítését a ``bash-completion`` csomag telepítésével. Ez automatikusan felismeri és betölti az ``/opt/otrs/.bash_completion`` fájlt az ``otrs`` felhasználó számára.

source: After restarting your shell, you can just type this command followed by TAB, and it will list all available commands:
de: Nach dem Neustart der Shell können Sie einfach diesen Befehl gefolgt von TAB eingeben und es werden alle verfügbaren Befehle gelistet:
hu: A parancsértelmező újraindítása után egyszerűen gépelje be ezt a parancsot, és utána nyomja le a TAB billentyűt, hogy felsorolja az összes elérhető parancsot:

source: If you type a few characters of the command name, TAB will show all matching commands. After typing a complete command, all possible options and arguments will be shown by pressing TAB.
de: Wenn Sie einige Zeichen des Befehlsnamens eingeben, zeigt TAB alle übereinstimmenden Befehle an. Nach Eingabe eines vollständigen Befehls werden durch Drücken von TAB alle möglichen Optionen und Argumente angezeigt.
hu: Ha a parancs nevének csak néhány karakterét gépeli be, a TAB billentyű meg fogja jeleníteni az összes egyező parancsot. Egy teljes parancs begépelése után az összes lehetséges kapcsoló és argumentum meg fog jelenni a TAB billentyű lenyomásakor.

source: By problems you can source it in your ~/.bashrc by adding this line:
de: Bei Problemen können Sie es in Ihre ~/.bashrc aufnehmen, indem Sie folgende Zeile hinzufügen:
hu: Probléma esetén hozzáadhatja a fájlt a ~/.bashrc fájlhoz ennek a sornak a hozzáadásával:

source: Step 13: Further Information
de: Schritt 13: Weitere Informationen
hu: 13. lépés: további információk

source: We advise you to read the OTRS :doc:`performance-tuning` chapter.
de: Wir empfehlen Ihnen, das Kapitel OTRS :doc:`performance-tuning` zu lesen.
hu: Javasoljuk az OTRS :doc:`performance-tuning` fejezetének elolvasását is.

source: Introduction
de: Einleitung
hu: Bevezetés

source: OTRS (Open Technology – Real Service) is an open source ticket request system with many features to manage customer telephone calls and emails. It is distributed under the GNU General Public License (GPL) and tested on various Linux platforms. Do you receive many e-mails and want to answer them with a team of agents? You're going to love OTRS!
de: OTRS (Open Technology – Real Service) ist ein Open-Source-Ticketabfragesystem mit vielen Funktionen zur Verwaltung von Kunden-Telefonanrufen und E-Mails. Es wird unter der GNU General Public License (GPL) vertrieben und wurde auf verschiedenen Linux-Plattformen getestet. Erhalten Sie viele E-Mails und möchten diese mit einem Agenten-Team beantworten? Dann werden Sie OTRS lieben!
hu: Az OTRS (Open Technology – Real Service) egy sok funkcióval rendelkező nyílt forráskódú jegykezelő rendszer az ügyfelek telefonhívásainak és e-mailjeinek kezeléséhez. A GNU General Public License (GPL) feltételei szerint terjeszthető, és számos Linux platformon próbálták ki. Rengeteg e-mailt kap és egy ügyintézőcsapattal szeretné megválaszolni azokat? Akkor imádni fogja az OTRS-t!

source: About This Manual
de: Über diese Anleitung
hu: Erről a kézikönyvről

source: This manual is intended for use by system administrators. The chapters describe the installation and updating of the OTRS software.
de: Dieses Handbuch ist für Systemadministratoren bestimmt. Die Kapitel beschreiben die Installation und Aktualisierung der OTRS-Software.
hu: Ezt a kézikönyvet a rendszer-adminisztrátorok általi használatra szánták. A fejezetek az OTRS szoftver telepítését és frissítését írják le.

source: There is no graphical user interface for installation and updating. System administrators have to follow the steps described in the following chapters.
de: Es gibt keine grafische Benutzeroberfläche für die Installation und Aktualisierung. Systemadministratoren müssen die in den folgenden Kapiteln beschriebenen Schritte ausführen.
hu: Nincs grafikus felhasználói felület a telepítéshez és a frissítéshez. A rendszer-adminisztrátoroknak a következő fejezetekben leírt lépéseket kell követniük.

source: All console commands look like ``username> command-to-execute``. Username indicates the user account of the operating system, which need to use to execute the command. If a command starts with ``root>``, you have to execute the command as a user who has root permissions. If a command starts with ``otrs>``, you have to execute the command as the user created for OTRS.
de: Alle Konsolenbefehle sehen aus wie ``Benutzername> Auszuführender Befehl``. Der Benutzername gibt das Benutzerkonto des Betriebssystems an, das zur Ausführung des Befehls verwendet werden muss. Wenn ein Befehl mit ``root>`` beginnt, müssen Sie den Befehl als Benutzer mit Root-Berechtigungen ausführen. Wenn ein Befehl mit ``otrs>`` beginnt, müssen Sie den Befehl als Benutzer ausführen, der für OTRS erstellt wurde.
hu: Az összes konzolparancs ``felhasználónév> végrehajtandó-parancs`` formában van megadva. A felhasználónév jelzi az operációs rendszernek azt a felhasználói fiókját, amelyet a parancs futtatásához használni kell. Ha egy parancs ``root>`` felhasználóval kezdődik, akkor a parancsot olyan felhasználóval kell végrehajtania, akinek rendszergazdai jogosultságai vannak. Ha egy parancs ``otrs>`` felhasználóval kezdődik, akkor a parancsot olyan felhasználóval kell végrehajtania, akit az OTRS-hez hoztak létre.

source: Don't select ``username>`` when you copy the command and paste it to the shell. Otherwise you will get an error.
de: Wählen Sie nicht ``Benutzername>`` aus, wenn Sie den Befehl kopieren und in die Shell einfügen. Andernfalls erhalten Sie eine Fehlermeldung.
hu: Ne jelölje ki a ``felhasználónév>`` előtagot, amikor lemásolja a parancsot és beilleszti a parancsértelmezőbe. Különben hibát fog kapni.

source: We supposed that OTRS will be installed to ``/opt/otrs``. If you want to install OTRS to a different directory, then you have to change the path in the commands or create a symbolic link to this directory.
de: Wir gehen davon aus, dass OTRS in ``/opt/otrs`` installiert wird. Wenn Sie OTRS in einem anderen Verzeichnis installieren möchten, dann müssen Sie den Pfad bei Befehlsaufruf ändern oder einen symbolischen Link zu diesem Verteichnis erstellen.
hu: Feltételezzük, hogy az OTRS az ``/opt/otrs`` könyvtárba lesz telepítve. Ha egy másik könyvtárba szeretné telepíteni az OTRS-t, akkor ki kell cserélnie az útvonalat a parancsokban, vagy létre kell hoznia egy szimbolikus hivatkozást arra a könyvtárra.

source: Performance Tuning
de: Leistungsverbesserung
hu: Teljesítmény hangolás

source: There is a list of performance enhancing techniques for your OTRS installation, including configuration, coding, memory use, and more.
de: Es gibt eine Liste mit leistungsverbessernden Techniken für Ihre OTRS-Installation, einschließlich Konfiguration, Codierung, Speichernutzung und mehr.
hu: Létezik egy sor teljesítmény-javító technika az OTRS telepítéséhez, beleértve a beállítást, a kódolást, a memóriahasználatot és egyebeket.

source: Ticket Index Module
de: Ticket-Index-Modul
hu: Jegyindexelő modul

source: Ticket index module can be set in system configuration setting ``Ticket::IndexModule``. There are two back end modules for the index for the ticket queue view:
de: Das Ticket-Index-Modul kann in der Systemkonfigurationseinstellung ``Ticket::IndexModule`` eingestellt werden. Es gibt zwei Backend-Module für den Index der Ticket-Queueansicht:
hu: A jegyindexelő modul a ``Ticket::IndexModule`` rendszerbeállítási lehetőségben állítható be. Két háttérprogram-modul létezik a jegy várólista nézetének indexeléséhez:

source: This is the default option, and will generate each queue view on the fly from the ticket table. You will not have performance trouble until you have about 60,000 open tickets in your system.
de: Das ist die Standardoption und generiert jede Queueansicht direkt aus der Ticket-Tabelle. Bei bis zu ca. 60.000 in Ihrem System offenen Tickets werden Sie damit keine Leistungsprobleme haben.
hu: Ez az alapértelmezett beállítás, és minden egyes várólista nézetet röptében állít elő a jegytáblából. Nem lesz teljesítmény problémája, amíg nincs körülbelül 60 000 nyitott jegye a rendszeren.

source: The most powerful module, should be used when you have above 80,000 open tickets. It uses an extra ``ticket_index`` table, which will be populated with keywords based on ticket data. Use the following command for generating an initial index after switching back ends:
de: Das leistungsstärkste Modul sollte verwendet werden, wenn Sie über 80.000 offene Tickets haben. Es verwendet eine zusätzliche ``ticket_index``-Tabelle, die mit auf Ticketdaten basierenden Schlüsselwörtern aufgefüllt wird. Verwenden Sie den folgenden Befehl, um einen Anfangsindex nach dem Wechsel der Backends zu erstellen:
hu: A legerőteljesebb modul, amelyet akkor kell használnia, ha több mint 80 000 nyitott jegye van. Ez egy további ``ticket_index`` táblát használ, amely kulcsszavakkal lesz feltöltve a jegyadatok alapján. Használja a következő parancsot egy kezdeti index előállításához a háttérprogramok átkapcsolása után:

source: Ticket Search Index
de: Ticket-Suchindex
hu: Jegykeresési index

source: OTRS uses a special search index to perform full-text searches across fields in articles from different communication channels.
de: OTRS verwendet einen speziellen Suchindex, um Volltextsuchen über Felder in Artikeln aus verschiedenen Kommunikationskanälen durchzuführen.
hu: Az OTRS egy különleges keresési indexet használ a szabad-szavas keresések végrehajtásához a különböző kommunikációs csatornákból érkező bejegyzések mezőiben.

source: To create an initial index, use this command:
de: Verwenden Sie diesen Befehl, um einen Anfangsindex zu erstellen:
hu: Egy kezdeti index létrehozásához használja ezt a parancsot:

source: Actual article indexing happens via an OTRS daemon job in the background. While articles which were just added in the system are marked for indexing immediately, it could happen their index is available within a few minutes.
de: Die eigentliche Artikelindizierung erfolgt über einen OTRS-Daemon-Job im Hintergrund. Weil die Artikel, die gerade dem System hinzugefügt wurden, sofort für die Indizierung markiert werden, kann es sein, dass ihr Index erst innerhalb einiger Minuten verfügbar ist.
hu: A tényleges bejegyzésindexelés egy OTRS démonfeladaton keresztül történik a háttérben. Mivel a rendszerhez éppen hozzáadott bejegyzések azonnal meg lesznek jelölve indexelésre, így megtörténhet, hogy az indexük néhány percen belül elérhető lesz.

source: There are some options available for fine tuning the search index:
de: Es gibt einige Optionen zur Feinabstimmung des Suchindex:
hu: Elérhető néhány beállítás a keresési index finomhangolásához:

source: Defines if archived tickets will be included in the search index (not enabled by default). This is advisable to keep the index small on large systems with archived tickets. If this is enabled, archived tickets will be found by full-text searches.
de: Legt fest, ob archivierte Tickets in den Suchindex aufgenommen werden (standardmäßig nicht aktiviert). Dies ist ratsam, um den Index bei großen Systemen mit archivierten Tickets klein zu halten. Wenn diese Option aktiviert ist, werden archivierte Tickets durch Volltextsuche gefunden.
hu: Meghatározza, hogy az archivált jegyek fel legyenek-e véve a keresési indexbe (alapértelmezetten nincs engedélyezve). Ajánlott az indexet kis méretűként tartani archivált jegyekkel rendelkező nagy rendszereken. Ha ez engedélyezve, akkor az archivált jegyek megtalálhatók lesznek a szabad-szavas keresésekkel.

source: Basic full-text index settings.
de: Grundlegende Einstellungen für den Volltextindex.
hu: Alapvető szabad-szavas index beállítások.

source: ``Ticket::SearchIndex::Attribute`` Setting
de: ``Ticket::SearchIndex::Attribute`` Einstellung
hu: A ``Ticket::SearchIndex::Attribute`` beállítás

source: Run the following command in order to generate a new index:
de: Führen Sie das folgende Kommando aus, um einen neuen Index zu generieren:
hu: Futtassa a következő parancsot egy új index előállításának érdekében:

source: Defines the maximum number of words which will be processed to build up the index. For example only the first 1000 words of an article body are stored in the article search index.
de: Definiert die maximale Anzahl von Wörtern, die zum Aufbau des Index verarbeitet werden. Zum Beispiel, dass nur die ersten 1000 Wörter des Artikelkörpers im Artikelsuchindex gespeichert werden.
hu: Meghatározza azon szavak legnagyobb számát, amelyek feldolgozásra kerülnek az index felépítéséhez. Például egy bejegyzés törzsének csak az első 1000 szava legyen eltárolva a bejegyzés keresési indexében.

source: ``WordLengthMin`` and ``WordLengthMax``
de: ``WordLengthMin`` und ``WordLengthMax``
hu: ``WordLengthMin`` és ``WordLengthMax``

source: Used as word length boundaries. Only words with a length between these two values are stored in the article search index.
de: Wird als Wortlängenbegrenzung verwendet. Nur Wörter mit einer Länge zwischen diesen beiden Werten werden im Artikelsuchindex gespeichert.
hu: Szóhossz határokként vannak használva. Csak azok a szavak vannak eltárolva a bejegyzés keresési indexében, amelyek hossza ezen két érték közé esik.

source: Full-text index regular expression filters to remove parts of the text.
de: Reguläre Ausdrücke für den Volltextindex-Filter, um Teile des Textes zu entfernen.
hu: Szabad-szavas index reguláris kifejezés szűrők a szöveg részeinek eltávolításához.

source: There are three default filters defined:
de: Es sind drei Standardfilter definiert:
hu: Három alapértelmezett szűrő van meghatározva:

source: The first filter strips out special chars like: , & < > ? " ! * | ; [ ] ( ) + $ ^ =
de: Der erste Filter entfernt Sonderzeichen wie: , & < > ? " ! * | ; [ ] ( ) + $ ^ =
hu: Az első szűrő eltávolítja a különleges karaktereket, mint például: , & < > ? " ! * | ; [ ] ( ) + $ ^ =

source: The second filter strips out words which begin or ends with one of following chars: ' : .
de: Der zweite Filter entfernt Wörter die mit einem der folgenden Zeichen beginnen oder enden: ' : .
hu: A második szűrő eltávolítja azokat a szavakat, amelyek a következő karakterek egyikével kezdődnek vagy végződnek: ' : .

source: The third filter strips out words which do not contain a word-character: a-z, A-Z, 0-9, _
de: Der dritte Filter entfernt Wörter, die kein Wortzeichen enthalten: a-z, A-Z, 0-9, _
hu: A harmadik szűrő eltávolítja azokat a szavakat, amelyek nem tartalmaznak egy szókaraktert: a-z, A-Z, 0-9, _

source: English stop words for full-text index. These words will be removed from the search index.
de: Englische Stoppwörter für den Volltextindex. Diese Wörter werden aus dem Suchindex entfernt.
hu: Angol kiszűrendő szavak a szabad-szavas indexnél. Ezek a szavak el lesznek távolítva a keresési indexből.

source: ``Ticket::SearchIndex::StopWords###en`` Setting
de: ``Ticket::SearchIndex::StopWords###en`` Einstellung
hu: A ``Ticket::SearchIndex::StopWords###en`` beállítás

source: There are so-called stop-words defined for some languages. These stop-words will be skipped while creating the search index.
de: Für einige Sprachen sind sogenannte Stoppwörter definiert. Diese Stoppwörter werden beim Erstellen des Suchindex übersprungen.
hu: Úgynevezett kiszűrendő szavak vannak meghatározva néhány nyelvnél. Ezek a kiszűrendő szavak ki lesznek hagyva a keresési index létrehozásakor.

source: If your language is not in the system configuration settings or you want to add more words, you can add them to this setting:
de: Wenn Ihre Sprache nicht in den Systemkonfigurationseinstellungen enthalten ist oder Sie weitere Wörter hinzufügen möchten, können Sie diese mit dieser Einstellung hinzufügen:
hu: Ha az Ön nyelve nincs benne a rendszerbeállítási lehetőségekben vagy több szót szeretne hozzáadni, akkor hozzáadhatja azokat ehhez a beállításhoz:

source: Article Storage
de: Artikelspeicherung
hu: Bejegyzéstárolás

source: There are two different back end modules for the article storage of phone, email and internal articles. The used article storage can be configured in the setting ``Ticket::Article::Backend::MIMEBase::ArticleStorage``.
de: Es gibt zwei verschiedene Backend-Module für die Artikelspeicherung von Telefon-, E-Mail- und internen Artikeln. Der verwendete Artikelspeicher kann in der Einstellung ``Ticket::Article::Backend::MIMEBase::ArticleStorage`` konfiguriert werden.
hu: Két különböző háttérprogram-modul létezik a telefonos, e-mail és belső bejegyzések bejegyzéstárolásához. A használt bejegyzéstároló a ``Ticket::Article::Backend::MIMEBase::ArticleStorage`` beállításban állítható be.

source: This default module will store attachments in the database. It also works with multiple front end servers, but requires much storage space in the database.
de: Dieses Standardmodul speichert Anlagen in der Datenbank. Es funktioniert auch mit mehreren Frontend-Servern, erfordert jedoch viel Speicherplatz in der Datenbank.
hu: Ez az alapértelmezett modul a mellékleteket az adatbázisban fogja eltárolni. Működik több előtétprogramos kiszolgálókkal is, de több tárolóhelyet igényel az adatbázisban.

source: Don't use this with large setups.
de: Verwenden Sie dies nicht bei großen Setups.
hu: Ne használja ezt nagy rendszereknél.

source: Use this module to store attachments on the local file system. It is fast, but if you have multiple front end servers, you must make sure the file system is shared between the servers. Place it on an NFS share or preferably a SAN or similar solution.
de: Verwenden Sie dieses Modul, um Anlagen im lokalen Dateisystem zu speichern. Dies ist zwar schnell, aber wenn Sie über mehrere Frontend-Server verfügen, müssen Sie sicherstellen, dass das Dateisystem von den Servern gemeinsam genutzt wird. Legen Sie es auf eine NFS-Freigabe oder vorzugsweise auf ein SAN oder eine ähnliche Lösung.
hu: Használja ezt a modult a mellékletek helyi fájlrendszeren történő tárolásához. Ez gyors, de ha több előtétprogramos kiszolgálói vannak, akkor meg kell győződnie arról, hogy a fájlrendszer meg van-e osztva a kiszolgálók között. Helyezze azt egy NFS megosztásra vagy inkább egy SAN vagy hasonló megoldásra.

source: Recommended for large setups.
de: Empfohlen für große Setups.
hu: Ajánlott nagy rendszereknél.

source: You can switch from one back end to the other on the fly. You can switch the back end in the system configuration, and then run this command line utility to put the articles from the database onto the file system or the other way around:
de: Sie können zügig von einem Backend zum anderen wechseln. Sie können das Backend in der Systemkonfiguration wechseln und dann dieses Befehlszeilendienstprogramm ausführen, um die Artikel aus der Datenbank in das Dateisystem zu laden oder umgekehrt:
hu: Átkapcsolhat menet közben az egyik háttérprogramról a másikra. A háttérprogramot a rendszerbeállításokban kapcsolhatja át, és azután futtassa le ezt a parancssori segédprogramot a bejegyzések átrakásához az adatbázisból a fájlrendszerre vagy fordítva.

source: You can use the ``--target`` option to specify the target back end.
de: Sie können die Option ``--target`` verwenden, um das Ziel-Backend festzulegen.
hu: A ``--target`` kapcsolót használhatja a cél háttérprogram megadásához.
